ИТ_Фирма/src/Documents/НачислениеПоОкладу/НачислениеПоОкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПоОкладу</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.Календарь</schedule>
  <scheduleValue>InformationRegister.Календарь.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

ИТ_Фирма/src/Documents/НачислениеПоОкладу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Оклад КАК Оклад,
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО НачислениеПоОкладуСотрудники.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	НачислениеПоОкладуСотрудники.Сотрудник.Ссылка = Сотрудники.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвижениеЗарплата = Движения.Зарплата.Добавить();
		ДвижениеЗарплата.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
		ДвижениеЗарплата.Сотрудник = Выборка.Сотрудник;
		ДвижениеЗарплата.ПериодРегистрации = Дата;
		ДвижениеЗарплата.ПериодДействияНачало = НачалоМесяца(Дата);
		ДвижениеЗарплата.ПериодДействияКонец = КонецМесяца(Дата);
		ДвижениеЗарплата.Показатель = Выборка.Оклад; 
		Движения.Зарплата.Записать();
		
	КонецЦИкла;				
	
	Для Каждого Движение Из Движения.Зарплата Цикл
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор,
		ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочихДней;
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор,
		ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочихДней;
		
		Движение.Сумма = Движение.Показатель * Факт / Норма;
		
	КонецЦикла;	
	
	Движения.Зарплата.Записать(,Истина);	
	
КонецПроцедуры
